Tekla.Structures.ModelInternal.GraphicText
Graphic object is a container for drawable object in Tekla Structures model view

Tekla.Structures.ModelInternal.GraphicText.Text
Defines text.

Tekla.Structures.ModelInternal.GraphicText.Color
Color of the text.

Tekla.Structures.ModelInternal.GraphicText.Size
Size of the text.

Tekla.Structures.ModelInternal.GraphicText.Point
Position of the text.

Tekla.Structures.ModelInternal.GraphicText.#ctor(System.String,Tekla.Structures.Geometry3d.Point,Tekla.Structures.Model.UI.Color,System.Double)
Initializes a new instance of the Tekla.Structures.ModelInternal.GraphicText class.
Default color is solid black.